Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/smc.h
/* -------- SMC_MODE : (SMC Offset: 0x0C) (R/W 32) SMC Mode Register -------- */
#define SMC_MODE_READ_MODE_Pos                _U_(0)                                               /**< (SMC_MODE) Selection of the Control Signal for Read Operation Position */
#define SMC_MODE_READ_MODE_Msk                (_U_(0x1) << SMC_MODE_READ_MODE_Pos)                 /**< (SMC_MODE) Selection of the Control Signal for Read Operation Mask */
#define SMC_MODE_READ_MODE(value)             (SMC_MODE_READ_MODE_Msk & ((value) << SMC_MODE_READ_MODE_Pos))
#define   SMC_MODE_READ_MODE_NCS_CTRL_Val     _U_(0x0)                                             /**< (SMC_MODE) Read operation controlled by NCS signal- If TDF cycles are programmed, the external bus is marked busy after the rising edge of NCS.- If TDF optimization is enabled (TDF_MODE = 1), TDF wait states are inserted after the setup of NCS.  */
#define   SMC_MODE_READ_MODE_NRD_CTRL_Val     _U_(0x1)                                             /**< (SMC_MODE) Read operation controlled by NRD signal- If TDF cycles are programmed, the external bus is marked busy after the rising edge of NRD.- If TDF optimization is enabled (TDF_MODE = 1), TDF wait states are inserted after the setup of NRD.  */
#define SMC_MODE_READ_MODE_NCS_CTRL           (SMC_MODE_READ_MODE_NCS_CTRL_Val << SMC_MODE_READ_MODE_Pos) /**< (SMC_MODE) Read operation controlled by NCS signal- If TDF cycles are programmed, the external bus is marked busy after the rising edge of NCS.- If TDF optimization is enabled (TDF_MODE = 1), TDF wait states are inserted after the setup of NCS. Position  */
#define SMC_MODE_READ_MODE_NRD_CTRL           (SMC_MODE_READ_MODE_NRD_CTRL_Val << SMC_MODE_READ_MODE_Pos) /**< (SMC_MODE) Read operation controlled by NRD signal- If TDF cycles are programmed, the external bus is marked busy after the rising edge of NRD.- If TDF optimization is enabled (TDF_MODE = 1), TDF wait states are inserted after the setup of NRD. Position  */
#define SMC_MODE_WRITE_MODE_Pos               _U_(1)                                               /**< (SMC_MODE) Selection of the Control Signal for Write Operation Position */
#define SMC_MODE_WRITE_MODE_Msk               (_U_(0x1) << SMC_MODE_WRITE_MODE_Pos)                /**< (SMC_MODE) Selection of the Control Signal for Write Operation Mask */
#define SMC_MODE_WRITE_MODE(value)            (SMC_MODE_WRITE_MODE_Msk & ((value) << SMC_MODE_WRITE_MODE_Pos))
#define   SMC_MODE_WRITE_MODE_NCS_CTRL_Val    _U_(0x0)                                             /**< (SMC_MODE) Write operation controlled by NCS signal-If TDF optimization is enabled (TDF_MODE = 1), TDF wait states will be inserted after the setup of NCS.  */
#define   SMC_MODE_WRITE_MODE_NWE_CTRL_Val    _U_(0x1)                                             /**< (SMC_MODE) Write operation controlled by NWE signal-If TDF optimization is enabled (TDF_MODE = 1), TDF wait states will be inserted after the setup of NWE.  */
#define SMC_MODE_WRITE_MODE_NCS_CTRL          (SMC_MODE_WRITE_MODE_NCS_CTRL_Val << SMC_MODE_WRITE_MODE_Pos) /**< (SMC_MODE) Write operation controlled by NCS signal-If TDF optimization is enabled (TDF_MODE = 1), TDF wait states will be inserted after the setup of NCS. Position  */
#define SMC_MODE_WRITE_MODE_NWE_CTRL          (SMC_MODE_WRITE_MODE_NWE_CTRL_Val << SMC_MODE_WRITE_MODE_Pos) /**< (SMC_MODE) Write operation controlled by NWE signal-If TDF optimization is enabled (TDF_MODE = 1), TDF wait states will be inserted after the setup of NWE. Position  */
#define SMC_MODE_EXNW_MODE_Pos                _U_(4)                                               /**< (SMC_MODE) NWAIT Mode Position */
#define SMC_MODE_EXNW_MODE_Msk                (_U_(0x3) << SMC_MODE_EXNW_MODE_Pos)                 /**< (SMC_MODE) NWAIT Mode Mask */
#define SMC_MODE_EXNW_MODE(value)             (SMC_MODE_EXNW_MODE_Msk & ((value) << SMC_MODE_EXNW_MODE_Pos))
#define   SMC_MODE_EXNW_MODE_DISABLED_Val     _U_(0x0)                                             /**< (SMC_MODE) Disabled Mode-The NWAIT input signal is ignored on the corresponding Chip Select.  */
#define   SMC_MODE_EXNW_MODE_FROZEN_Val       _U_(0x2)                                             /**< (SMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   SMC_MODE_EXNW_MODE_READY_Val        _U_(0x3)                                             /**< (SMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define SMC_MODE_EXNW_MODE_DISABLED           (SMC_MODE_EXNW_MODE_DISABLED_Val << SMC_MODE_EXNW_MODE_Pos) /**< (SMC_MODE) Disabled Mode-The NWAIT input signal is ignored on the corresponding Chip Select. Position  */
#define SMC_MODE_EXNW_MODE_FROZEN             (SMC_MODE_EXNW_MODE_FROZEN_Val << SMC_MODE_EXNW_MODE_Pos) /**< (SMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define SMC_MODE_EXNW_MODE_READY              (SMC_MODE_EXNW_MODE_READY_Val << SMC_MODE_EXNW_MODE_Pos) /**< (SMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define SMC_MODE_BAT_Pos                      _U_(8)                                               /**< (SMC_MODE) Byte Access Type Position */
#define SMC_MODE_BAT_Msk                      (_U_(0x1) << SMC_MODE_BAT_Pos)                       /**< (SMC_MODE) Byte Access Type Mask */
#define SMC_MODE_BAT(value)                   (SMC_MODE_BAT_Msk & ((value) << SMC_MODE_BAT_Pos))  
#define   SMC_MODE_BAT_BYTE_SELECT_Val        _U_(0x0)                                             /**< (SMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1, NBS2 and NBS3- Read operation is controlled using NCS, NRD, NBS0, NBS1, NBS2 and NBS3  */
#define   SMC_MODE_BAT_BYTE_WRITE_Val         _U_(0x1)                                             /**< (SMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1, NWR2, NWR3- Read operation is controlled using NCS and NRD  */
#define SMC_MODE_BAT_BYTE_SELECT              (SMC_MODE_BAT_BYTE_SELECT_Val << SMC_MODE_BAT_Pos)   /**< (SMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1, NBS2 and NBS3- Read operation is controlled using NCS, NRD, NBS0, NBS1, NBS2 and NBS3 Position  */
#define SMC_MODE_BAT_BYTE_WRITE               (SMC_MODE_BAT_BYTE_WRITE_Val << SMC_MODE_BAT_Pos)    /**< (SMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1, NWR2, NWR3- Read operation is controlled using NCS and NRD Position  */
#define SMC_MODE_DBW_Pos                      _U_(12)                                              /**< (SMC_MODE) Data Bus Width Position */
#define SMC_MODE_DBW_Msk                      (_U_(0x3) << SMC_MODE_DBW_Pos)                       /**< (SMC_MODE) Data Bus Width Mask */
#define SMC_MODE_DBW(value)                   (SMC_MODE_DBW_Msk & ((value) << SMC_MODE_DBW_Pos))  
#define   SMC_MODE_DBW_BIT_8_Val              _U_(0x0)                                             /**< (SMC_MODE) 8-bit bus  */
#define   SMC_MODE_DBW_BIT_16_Val             _U_(0x1)                                             /**< (SMC_MODE) 16-bit bus  */
#define   SMC_MODE_DBW_BIT_32_Val             _U_(0x2)                                             /**< (SMC_MODE) 32-bit bus  */
#define SMC_MODE_DBW_BIT_8                    (SMC_MODE_DBW_BIT_8_Val << SMC_MODE_DBW_Pos)         /**< (SMC_MODE) 8-bit bus Position  */
#define SMC_MODE_DBW_BIT_16                   (SMC_MODE_DBW_BIT_16_Val << SMC_MODE_DBW_Pos)        /**< (SMC_MODE) 16-bit bus Position  */
#define SMC_MODE_DBW_BIT_32                   (SMC_MODE_DBW_BIT_32_Val << SMC_MODE_DBW_Pos)        /**< (SMC_MODE) 32-bit bus Position  */
#define SMC_MODE_TDF_CYCLES_Pos               _U_(16)                                              /**< (SMC_MODE) Data Float Time Position */
#define SMC_MODE_TDF_CYCLES_Msk               (_U_(0xF) << SMC_MODE_TDF_CYCLES_Pos)                /**< (SMC_MODE) Data Float Time Mask */
#define SMC_MODE_TDF_CYCLES(value)            (SMC_MODE_TDF_CYCLES_Msk & ((value) << SMC_MODE_TDF_CYCLES_Pos))
#define SMC_MODE_TDF_MODE_Pos                 _U_(20)                                              /**< (SMC_MODE) TDF Optimization Position */
#define SMC_MODE_TDF_MODE_Msk                 (_U_(0x1) << SMC_MODE_TDF_MODE_Pos)                  /**< (SMC_MODE) TDF Optimization Mask */
#define SMC_MODE_TDF_MODE(value)              (SMC_MODE_TDF_MODE_Msk & ((value) << SMC_MODE_TDF_MODE_Pos))
#define SMC_MODE_PMEN_Pos                     _U_(24)                                              /**< (SMC_MODE) Page Mode Enabled Position */
#define SMC_MODE_PMEN_Msk                     (_U_(0x1) << SMC_MODE_PMEN_Pos)                      /**< (SMC_MODE) Page Mode Enabled Mask */
#define SMC_MODE_PMEN(value)                  (SMC_MODE_PMEN_Msk & ((value) << SMC_MODE_PMEN_Pos))
#define SMC_MODE_PS_Pos                       _U_(28)                                              /**< (SMC_MODE) Page Size Position */
#define SMC_MODE_PS_Msk                       (_U_(0x3) << SMC_MODE_PS_Pos)                        /**< (SMC_MODE) Page Size Mask */
#define SMC_MODE_PS(value)                    (SMC_MODE_PS_Msk & ((value) << SMC_MODE_PS_Pos))    
#define   SMC_MODE_PS_BYTE_4_Val              _U_(0x0)                                             /**< (SMC_MODE) 4-byte page  */
#define   SMC_MODE_PS_BYTE_8_Val              _U_(0x1)                                             /**< (SMC_MODE) 8-byte page  */
#define   SMC_MODE_PS_BYTE_16_Val             _U_(0x2)                                             /**< (SMC_MODE) 16-byte page  */
#define   SMC_MODE_PS_BYTE_32_Val             _U_(0x3)                                             /**< (SMC_MODE) 32-byte page  */
#define SMC_MODE_PS_BYTE_4                    (SMC_MODE_PS_BYTE_4_Val << SMC_MODE_PS_Pos)          /**< (SMC_MODE) 4-byte page Position  */
#define SMC_MODE_PS_BYTE_8                    (SMC_MODE_PS_BYTE_8_Val << SMC_MODE_PS_Pos)          /**< (SMC_MODE) 8-byte page Position  */
#define SMC_MODE_PS_BYTE_16                   (SMC_MODE_PS_BYTE_16_Val << SMC_MODE_PS_Pos)         /**< (SMC_MODE) 16-byte page Position  */
#define SMC_MODE_PS_BYTE_32                   (SMC_MODE_PS_BYTE_32_Val << SMC_MODE_PS_Pos)         /**< (SMC_MODE) 32-byte page Position  */
#define SMC_MODE_Msk                          _U_(0x311F3133)                                      /**< (SMC_MODE) Register Mask  */


/* -------- SMC_OCMS : (SMC Offset: 0x80) (R/W 32) SMC Off-Chip Memory Scrambling Register -------- */
#define SMC_OCMS_SMSE_Pos                     _U_(0)                                               /**< (SMC_OCMS) Static Memory Controller Scrambling Enable Position */
#define SMC_OCMS_SMSE_Msk                     (_U_(0x1) << SMC_OCMS_SMSE_Pos)                      /**< (SMC_OCMS) Static Memory Controller Scrambling Enable Mask */
#define SMC_OCMS_SMSE(value)                  (SMC_OCMS_SMSE_Msk & ((value) << SMC_OCMS_SMSE_Pos))
#define SMC_OCMS_TAMPCLR_Pos                  _U_(4)                                               /**< (SMC_OCMS) Tamper Clear Enable Position */
#define SMC_OCMS_TAMPCLR_Msk                  (_U_(0x1) << SMC_OCMS_TAMPCLR_Pos)                   /**< (SMC_OCMS) Tamper Clear Enable Mask */
#define SMC_OCMS_TAMPCLR(value)               (SMC_OCMS_TAMPCLR_Msk & ((value) << SMC_OCMS_TAMPCLR_Pos))
#define SMC_OCMS_CS0SE_Pos                    _U_(8)                                               /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS0SE_Msk                    (_U_(0x1) << SMC_OCMS_CS0SE_Pos)                     /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS0SE(value)                 (SMC_OCMS_CS0SE_Msk & ((value) << SMC_OCMS_CS0SE_Pos))
#define SMC_OCMS_CS1SE_Pos                    _U_(9)                                               /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS1SE_Msk                    (_U_(0x1) << SMC_OCMS_CS1SE_Pos)                     /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS1SE(value)                 (SMC_OCMS_CS1SE_Msk & ((value) << SMC_OCMS_CS1SE_Pos))
#define SMC_OCMS_CS2SE_Pos                    _U_(10)                                              /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS2SE_Msk                    (_U_(0x1) << SMC_OCMS_CS2SE_Pos)                     /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS2SE(value)                 (SMC_OCMS_CS2SE_Msk & ((value) << SMC_OCMS_CS2SE_Pos))
#define SMC_OCMS_CS3SE_Pos                    _U_(11)                                              /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS3SE_Msk                    (_U_(0x1) << SMC_OCMS_CS3SE_Pos)                     /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS3SE(value)                 (SMC_OCMS_CS3SE_Msk & ((value) << SMC_OCMS_CS3SE_Pos))
#define SMC_OCMS_Msk                          _U_(0x00000F11)                                      /**< (SMC_OCMS) Register Mask  */


/* -------- SMC_KEY1 : (SMC Offset: 0x84) ( /W 32) SMC Off-Chip Memory Scrambling KEY1 Register -------- */
#define SMC_KEY1_KEY1_Pos                     _U_(0)                                               /**< (SMC_KEY1) Off-Chip Memory Scrambling (OCMS) Key Part 1 Position */
#define SMC_KEY1_KEY1_Msk                     (_U_(0xFFFFFFFF) << SMC_KEY1_KEY1_Pos)               /**< (SMC_KEY1) Off-Chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define SMC_KEY1_KEY1(value)                  (SMC_KEY1_KEY1_Msk & ((value) << SMC_KEY1_KEY1_Pos))
#define SMC_KEY1_Msk                          _U_(0xFFFFFFFF)                                      /**< (SMC_KEY1) Register Mask  */


/* -------- SMC_KEY2 : (SMC Offset: 0x88) ( /W 32) SMC Off-Chip Memory Scrambling KEY2 Register -------- */
#define SMC_KEY2_KEY2_Pos                     _U_(0)                                               /**< (SMC_KEY2) Off-Chip Memory Scrambling (OCMS) Key Part 2 Position */
#define SMC_KEY2_KEY2_Msk                     (_U_(0xFFFFFFFF) << SMC_KEY2_KEY2_Pos)               /**< (SMC_KEY2) Off-Chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define SMC_KEY2_KEY2(value)                  (SMC_KEY2_KEY2_Msk & ((value) << SMC_KEY2_KEY2_Pos))
#define SMC_KEY2_Msk                          _U_(0xFFFFFFFF)                                      /**< (SMC_KEY2) Register Mask  */


/* -------- SMC_SRIER : (SMC Offset: 0x90) (R/W 32) SMC Safety Report Interrupt Enable Register -------- */
#define SMC_SRIER_SRIE_Pos                    _U_(0)                                               /**< (SMC_SRIER) Safety Report Interrupt Enable Position */
#define SMC_SRIER_SRIE_Msk                    (_U_(0x1) << SMC_SRIER_SRIE_Pos)                     /**< (SMC_SRIER) Safety Report Interrupt Enable Mask */
#define SMC_SRIER_SRIE(value)                 (SMC_SRIER_SRIE_Msk & ((value) << SMC_SRIER_SRIE_Pos))
#define SMC_SRIER_Msk                         _U_(0x00000001)                                      /**< (SMC_SRIER) Register Mask  */


/* -------- SMC_WPMR : (SMC Offset: 0xE4) (R/W 32) SMC Write Protection Mode Register -------- */
#define SMC_WPMR_WPEN_Pos                     _U_(0)                                               /**< (SMC_WPMR) Write Protection Enable Position */
#define SMC_WPMR_WPEN_Msk                     (_U_(0x1) << SMC_WPMR_WPEN_Pos)                      /**< (SMC_WPMR) Write Protection Enable Mask */
#define SMC_WPMR_WPEN(value)                  (SMC_WPMR_WPEN_Msk & ((value) << SMC_WPMR_WPEN_Pos))
#define SMC_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (SMC_WPMR) Write Protection Key Position */
#define SMC_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << SMC_WPMR_WPKEY_Pos)                /**< (SMC_WPMR) Write Protection Key Mask */
#define SMC_WPMR_WPKEY(value)                 (SMC_WPMR_WPKEY_Msk & ((value) << SMC_WPMR_WPKEY_Pos))
#define   SMC_WPMR_WPKEY_PASSWD_Val           _U_(0x534D43)                                        /**< (SMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.  */
#define SMC_WPMR_WPKEY_PASSWD                 (SMC_WPMR_WPKEY_PASSWD_Val << SMC_WPMR_WPKEY_Pos)    /**< (SMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0. Position  */
#define SMC_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (SMC_WPMR) Register Mask  */


/* -------- SMC_WPSR : (SMC Offset: 0xE8) ( R/ 32) SMC Write Protection Status Register -------- */
#define SMC_WPSR_WPVS_Pos                     _U_(0)                                               /**< (SMC_WPSR) Write Protection Violation Status (Cleared on read) Position */
#define SMC_WPSR_WPVS_Msk                     (_U_(0x1) << SMC_WPSR_WPVS_Pos)                      /**< (SMC_WPSR) Write Protection Violation Status (Cleared on read) Mask */
#define SMC_WPSR_WPVS(value)                  (SMC_WPSR_WPVS_Msk & ((value) << SMC_WPSR_WPVS_Pos))
#define SMC_WPSR_SEQE_Pos                     _U_(2)                                               /**< (SMC_WPSR) Internal Sequencer Error (Cleared on read) Position */
#define SMC_WPSR_SEQE_Msk                     (_U_(0x1) << SMC_WPSR_SEQE_Pos)                      /**< (SMC_WPSR) Internal Sequencer Error (Cleared on read) Mask */
#define SMC_WPSR_SEQE(value)                  (SMC_WPSR_SEQE_Msk & ((value) << SMC_WPSR_SEQE_Pos))
#define SMC_WPSR_SWE_Pos                      _U_(3)                                               /**< (SMC_WPSR) Software Control Error (Cleared on read) Position */
#define SMC_WPSR_SWE_Msk                      (_U_(0x1) << SMC_WPSR_SWE_Pos)                       /**< (SMC_WPSR) Software Control Error (Cleared on read) Mask */
#define SMC_WPSR_SWE(value)                   (SMC_WPSR_SWE_Msk & ((value) << SMC_WPSR_SWE_Pos))  
#define SMC_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (SMC_WPSR) Write Protection Violation Source Position */
#define SMC_WPSR_WPVSRC_Msk                   (_U_(0xFFFF) << SMC_WPSR_WPVSRC_Pos)                 /**< (SMC_WPSR) Write Protection Violation Source Mask */
#define SMC_WPSR_WPVSRC(value)                (SMC_WPSR_WPVSRC_Msk & ((value) << SMC_WPSR_WPVSRC_Pos))
#define SMC_WPSR_SWETYP_Pos                   _U_(24)                                              /**< (SMC_WPSR) Software Error Type (Cleared on read) Position */
#define SMC_WPSR_SWETYP_Msk                   (_U_(0x3) << SMC_WPSR_SWETYP_Pos)                    /**< (SMC_WPSR) Software Error Type (Cleared on read) Mask */
#define SMC_WPSR_SWETYP(value)                (SMC_WPSR_SWETYP_Msk & ((value) << SMC_WPSR_SWETYP_Pos))
#define   SMC_WPSR_SWETYP_READ_WO_Val         _U_(0x0)                                             /**< (SMC_WPSR) A write-only register has been read.  */
#define   SMC_WPSR_SWETYP_WRITE_RO_Val        _U_(0x1)                                             /**< (SMC_WPSR) A write access has been performed on a read-only register.  */
#define   SMC_WPSR_SWETYP_UNDEF_RW_Val        _U_(0x2)                                             /**< (SMC_WPSR) Access to an undefined address.  */
#define SMC_WPSR_SWETYP_READ_WO               (SMC_WPSR_SWETYP_READ_WO_Val << SMC_WPSR_SWETYP_Pos) /**< (SMC_WPSR) A write-only register has been read. Position  */
#define SMC_WPSR_SWETYP_WRITE_RO              (SMC_WPSR_SWETYP_WRITE_RO_Val << SMC_WPSR_SWETYP_Pos) /**< (SMC_WPSR) A write access has been performed on a read-only register. Position  */
#define SMC_WPSR_SWETYP_UNDEF_RW              (SMC_WPSR_SWETYP_UNDEF_RW_Val << SMC_WPSR_SWETYP_Pos) /**< (SMC_WPSR) Access to an undefined address. Position  */
#define SMC_WPSR_Msk                          _U_(0x03FFFF0D)                                      /**< (SMC_WPSR) Register Mask  */


