Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/smc.h
/* -------- SMC_VERSION : (SMC Offset: 0xFC) ( R/ 32) SMC Version Register -------- */
#define SMC_VERSION_VERSION_Pos               _U_(0)                                               /**< (SMC_VERSION) Hardware Version Number Position */
#define SMC_VERSION_VERSION_Msk               (_U_(0xFFF) << SMC_VERSION_VERSION_Pos)              /**< (SMC_VERSION) Hardware Version Number Mask */
#define SMC_VERSION_VERSION(value)            (SMC_VERSION_VERSION_Msk & ((value) << SMC_VERSION_VERSION_Pos))
#define SMC_VERSION_MFN_Pos                   _U_(16)                                              /**< (SMC_VERSION) Metal Fix Number Position */
#define SMC_VERSION_MFN_Msk                   (_U_(0x7) << SMC_VERSION_MFN_Pos)                    /**< (SMC_VERSION) Metal Fix Number Mask */
#define SMC_VERSION_MFN(value)                (SMC_VERSION_MFN_Msk & ((value) << SMC_VERSION_MFN_Pos))
#define SMC_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (SMC_VERSION) Register Mask  */


/** \brief SMC register offsets definitions */
#define SMC_SETUP_REG_OFST             (0x00)              /**< (SMC_SETUP) SMC Setup Register Offset */
#define SMC_PULSE_REG_OFST             (0x04)              /**< (SMC_PULSE) SMC Pulse Register Offset */
#define SMC_CYCLE_REG_OFST             (0x08)              /**< (SMC_CYCLE) SMC Cycle Register Offset */
#define SMC_MODE_REG_OFST              (0x0C)              /**< (SMC_MODE) SMC Mode Register Offset */
#define SMC_OCMS_REG_OFST              (0x80)              /**< (SMC_OCMS) SMC Off-Chip Memory Scrambling Register Offset */
#define SMC_KEY1_REG_OFST              (0x84)              /**< (SMC_KEY1) SMC Off-Chip Memory Scrambling KEY1 Register Offset */
#define SMC_KEY2_REG_OFST              (0x88)              /**< (SMC_KEY2) SMC Off-Chip Memory Scrambling KEY2 Register Offset */
#define SMC_SRIER_REG_OFST             (0x90)              /**< (SMC_SRIER) SMC Safety Report Interrupt Enable Register Offset */
#define SMC_WPMR_REG_OFST              (0xE4)              /**< (SMC_WPMR) SMC Write Protection Mode Register Offset */
#define SMC_WPSR_REG_OFST              (0xE8)              /**< (SMC_WPSR) SMC Write Protection Status Register Offset */
#define SMC_VERSION_REG_OFST           (0xFC)              /**< (SMC_VERSION) SMC Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SMC_CS_NUMBER register API structure */
typedef struct
{
  __IO  uint32_t                       SMC_SETUP;          /**< Offset: 0x00 (R/W  32) SMC Setup Register */
  __IO  uint32_t                       SMC_PULSE;          /**< Offset: 0x04 (R/W  32) SMC Pulse Register */
  __IO  uint32_t                       SMC_CYCLE;          /**< Offset: 0x08 (R/W  32) SMC Cycle Register */
  __IO  uint32_t                       SMC_MODE;           /**< Offset: 0x0C (R/W  32) SMC Mode Register */
} smc_cs_number_registers_t;

#define SMC_CS_NUMBER_NUMBER _U_(6)

/** \brief SMC register API structure */
typedef struct
{
        smc_cs_number_registers_t      SMC_CS_NUMBER[SMC_CS_NUMBER_NUMBER]; /**< Offset: 0x00  */
  __I   uint8_t                        Reserved1[0x20];
  __IO  uint32_t                       SMC_OCMS;           /**< Offset: 0x80 (R/W  32) SMC Off-Chip Memory Scrambling Register */
  __O   uint32_t                       SMC_KEY1;           /**< Offset: 0x84 ( /W  32) SMC Off-Chip Memory Scrambling KEY1 Register */
  __O   uint32_t                       SMC_KEY2;           /**< Offset: 0x88 ( /W  32) SMC Off-Chip Memory Scrambling KEY2 Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       SMC_SRIER;          /**< Offset: 0x90 (R/W  32) SMC Safety Report Interrupt Enable Register */
  __I   uint8_t                        Reserved3[0x50];
  __IO  uint32_t                       SMC_WPMR;           /**< Offset: 0xE4 (R/W  32) SMC Write Protection Mode Register */
  __I   uint32_t                       SMC_WPSR;           /**< Offset: 0xE8 (R/   32) SMC Write Protection Status Register */
  __I   uint8_t                        Reserved4[0x10];
  __I   uint32_t                       SMC_VERSION;        /**< Offset: 0xFC (R/   32) SMC Version Register */
} smc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_SMC_COMPONENT_H_ */
